export default {country:
    [   
    {
        "key": "安哥拉",
        "label": "安哥拉"
    },
    {
        "key": "阿富汗",
        "label": "阿富汗"
    },
    {
        "key": "阿尔巴尼亚",
        "label": "阿尔巴尼亚"
    },
    {
        "key": "阿尔及利亚",
        "label": "阿尔及利亚"
    },
    {
        "key": "安道尔共和国",
        "label": "安道尔共和国"
    },
    {
        "key": "安圭拉岛",
        "label": "安圭拉岛"
    },
    {
        "key": "安提瓜和巴布达",
        "label": "安提瓜和巴布达"
    },
    {
        "key": "阿根廷",
        "label": "阿根廷"
    },
    {
        "key": "亚美尼亚",
        "label": "亚美尼亚"
    },
    {
        "key": "澳大利亚",
        "label": "澳大利亚"
    },
    {
        "key": "奥地利",
        "label": "奥地利"
    },
    {
        "key": "阿塞拜疆",
        "label": "阿塞拜疆"
    },
    {
        "key": "巴哈马",
        "label": "巴哈马"
    },
    {
        "key": "巴林",
        "label": "巴林"
    },
    {
        "key": "孟加拉国",
        "label": "孟加拉国"
    },
    {
        "key": "巴巴多斯",
        "label": "巴巴多斯"
    },
    {
        "key": "白俄罗斯",
        "label": "白俄罗斯"
    },
    {
        "key": "比利时",
        "label": "比利时"
    },
    {
        "key": "伯利兹",
        "label": "伯利兹"
    },
    {
        "key": "贝宁",
        "label": "贝宁"
    },
    {
        "key": "百慕大群岛",
        "label": "百慕大群岛"
    },
    {
        "key": "玻利维亚",
        "label": "玻利维亚"
    },
    {
        "key": "博茨瓦纳",
        "label": "博茨瓦纳"
    },
    {
        "key": "巴西",
        "label": "巴西"
    },
    {
        "key": "文莱",
        "label": "文莱"
    },
    {
        "key": "保加利亚",
        "label": "保加利亚"
    },
    {
        "key": "布基纳法索",
        "label": "布基纳法索"
    },
    {
        "key": "缅甸",
        "label": "缅甸"
    },
    {
        "key": "布隆迪",
        "label": "布隆迪"
    },
    {
        "key": "喀麦隆",
        "label": "喀麦隆"
    },
    {
        "key": "加拿大",
        "label": "加拿大"
    },
    {
        "key": "中非共和国",
        "label": "中非共和国"
    },
    {
        "key": "乍得",
        "label": "乍得"
    },
    {
        "key": "智利",
        "label": "智利"
    },
    {
        "key": "中国",
        "label": "中国"
    },
    {
        "key": "哥伦比亚",
        "label": "哥伦比亚"
    },
    {
        "key": "刚果",
        "label": "刚果"
    },
    {
        "key": "库克群岛",
        "label": "库克群岛"
    },
    {
        "key": "哥斯达黎加",
        "label": "哥斯达黎加"
    },
    {
        "key": "古巴",
        "label": "古巴"
    },
    {
        "key": "塞浦路斯",
        "label": "塞浦路斯"
    },
    {
        "key": "捷克",
        "label": "捷克"
    },
    {
        "key": "丹麦",
        "label": "丹麦"
    },
    {
        "key": "吉布提",
        "label": "吉布提"
    },
    {
        "key": "多米尼加共和国",
        "label": "多米尼加共和国"
    },
    {
        "key": "厄瓜多尔",
        "label": "厄瓜多尔"
    },
    {
        "key": "埃及",
        "label": "埃及"
    },
    {
        "key": "萨尔瓦多",
        "label": "萨尔瓦多"
    },
    {
        "key": "爱沙尼亚",
        "label": "爱沙尼亚"
    },
    {
        "key": "埃塞俄比亚",
        "label": "埃塞俄比亚"
    },
    {
        "key": "斐济",
        "label": "斐济"
    },
    {
        "key": "芬兰",
        "label": "芬兰"
    },
    {
        "key": "法国",
        "label": "法国"
    },
    {
        "key": "法属圭亚那",
        "label": "法属圭亚那"
    },
    {
        "key": "加蓬",
        "label": "加蓬"
    },
    {
        "key": "冈比亚",
        "label": "冈比亚"
    },
    {
        "key": "格鲁吉亚",
        "label": "格鲁吉亚"
    },
    {
        "key": "德国",
        "label": "德国"
    },
    {
        "key": "加纳",
        "label": "加纳"
    },
    {
        "key": "直布罗陀",
        "label": "直布罗陀"
    },
    {
        "key": "希腊",
        "label": "希腊"
    },
    {
        "key": "格林纳达",
        "label": "格林纳达"
    },
    {
        "key": "关岛",
        "label": "关岛"
    },
    {
        "key": "危地马拉",
        "label": "危地马拉"
    },
    {
        "key": "几内亚",
        "label": "几内亚"
    },
    {
        "key": "圭亚那",
        "label": "圭亚那"
    },
    {
        "key": "海地",
        "label": "海地"
    },
    {
        "key": "洪都拉斯",
        "label": "洪都拉斯"
    },
    {
        "key": "香港",
        "label": "香港"
    },
    {
        "key": "匈牙利",
        "label": "匈牙利"
    },
    {
        "key": "冰岛",
        "label": "冰岛"
    },
    {
        "key": "印度",
        "label": "印度"
    },
    {
        "key": "印度尼西亚",
        "label": "印度尼西亚"
    },
    {
        "key": "伊朗",
        "label": "伊朗"
    },
    {
        "key": "伊拉克",
        "label": "伊拉克"
    },
    {
        "key": "爱尔兰",
        "label": "爱尔兰"
    },
    {
        "key": "以色列",
        "label": "以色列"
    },
    {
        "key": "意大利",
        "label": "意大利"
    },
    {
        "key": "牙买加",
        "label": "牙买加"
    },
    {
        "key": "日本",
        "label": "日本"
    },
    {
        "key": "约旦",
        "label": "约旦"
    },
    {
        "key": "柬埔寨",
        "label": "柬埔寨"
    },
    {
        "key": "哈萨克斯坦",
        "label": "哈萨克斯坦"
    },
    {
        "key": "肯尼亚",
        "label": "肯尼亚"
    },
    {
        "key": "韩国",
        "label": "韩国"
    },
    {
        "key": "科威特",
        "label": "科威特"
    },
    {
        "key": "吉尔吉斯坦",
        "label": "吉尔吉斯坦"
    },
    {
        "key": "老挝",
        "label": "老挝"
    },
    {
        "key": "拉脱维亚",
        "label": "拉脱维亚"
    },
    {
        "key": "黎巴嫩",
        "label": "黎巴嫩"
    },
    {
        "key": "莱索托",
        "label": "莱索托"
    },
    {
        "key": "利比里亚",
        "label": "利比里亚"
    },
    {
        "key": "利比亚",
        "label": "利比亚"
    },
    {
        "key": "列支敦士登",
        "label": "列支敦士登"
    },
    {
        "key": "立陶宛",
        "label": "立陶宛"
    },
    {
        "key": "卢森堡",
        "label": "卢森堡"
    },
    {
        "key": "澳门",
        "label": "澳门"
    },
    {
        "key": "马达加斯加",
        "label": "马达加斯加"
    },
    {
        "key": "马拉维",
        "label": "马拉维"
    },
    {
        "key": "马来西亚",
        "label": "马来西亚"
    },
    {
        "key": "马尔代夫",
        "label": "马尔代夫"
    },
    {
        "key": "马里",
        "label": "马里"
    },
    {
        "key": "马耳他",
        "label": "马耳他"
    },
    {
        "key": "毛里求斯",
        "label": "毛里求斯"
    },
    {
        "key": "墨西哥",
        "label": "墨西哥"
    },
    {
        "key": "摩尔多瓦",
        "label": "摩尔多瓦"
    },
    {
        "key": "摩纳哥",
        "label": "摩纳哥"
    },
    {
        "key": "蒙古",
        "label": "蒙古"
    },
    {
        "key": "蒙特塞拉特岛",
        "label": "蒙特塞拉特岛"
    },
    {
        "key": "摩洛哥",
        "label": "摩洛哥"
    },
    {
        "key": "莫桑比克",
        "label": "莫桑比克"
    },
    {
        "key": "纳米比亚",
        "label": "纳米比亚"
    },
    {
        "key": "瑙鲁",
        "label": "瑙鲁"
    },
    {
        "key": "尼泊尔",
        "label": "尼泊尔"
    },
    {
        "key": "荷兰",
        "label": "荷兰"
    },
    {
        "key": "新西兰",
        "label": "新西兰"
    },
    {
        "key": "尼加拉瓜",
        "label": "尼加拉瓜"
    },
    {
        "key": "尼日尔",
        "label": "尼日尔"
    },
    {
        "key": "尼日利亚",
        "label": "尼日利亚"
    },
    {
        "key": "朝鲜",
        "label": "朝鲜"
    },
    {
        "key": "挪威",
        "label": "挪威"
    },
    {
        "key": "阿曼",
        "label": "阿曼"
    },
    {
        "key": "巴基斯坦",
        "label": "巴基斯坦"
    },
    {
        "key": "巴拿马",
        "label": "巴拿马"
    },
    {
        "key": "巴布亚新几内亚",
        "label": "巴布亚新几内亚"
    },
    {
        "key": "巴拉圭",
        "label": "巴拉圭"
    },
    {
        "key": "秘鲁",
        "label": "秘鲁"
    },
    {
        "key": "菲律宾",
        "label": "菲律宾"
    },
    {
        "key": "波兰",
        "label": "波兰"
    },
    {
        "key": "法属玻利尼西亚",
        "label": "法属玻利尼西亚"
    },
    {
        "key": "葡萄牙",
        "label": "葡萄牙"
    },
    {
        "key": "波多黎各",
        "label": "波多黎各"
    },
    {
        "key": "卡塔尔",
        "label": "卡塔尔"
    },
    {
        "key": "罗马尼亚",
        "label": "罗马尼亚"
    },
    {
        "key": "俄罗斯",
        "label": "俄罗斯"
    },
    {
        "key": "圣卢西亚",
        "label": "圣卢西亚"
    },
    {
        "key": "圣文森特岛",
        "label": "圣文森特岛"
    },
    {
        "key": "圣马力诺",
        "label": "圣马力诺"
    },
    {
        "key": "圣多美和普林西比",
        "label": "圣多美和普林西比"
    },
    {
        "key": "沙特阿拉伯",
        "label": "沙特阿拉伯"
    },
    {
        "key": "塞内加尔",
        "label": "塞内加尔"
    },
    {
        "key": "塞舌尔",
        "label": "塞舌尔"
    },
    {
        "key": "塞拉利昂",
        "label": "塞拉利昂"
    },
    {
        "key": "新加坡",
        "label": "新加坡"
    },
    {
        "key": "斯洛伐克",
        "label": "斯洛伐克"
    },
    {
        "key": "斯洛文尼亚",
        "label": "斯洛文尼亚"
    },
    {
        "key": "所罗门群岛",
        "label": "所罗门群岛"
    },
    {
        "key": "索马里",
        "label": "索马里"
    },
    {
        "key": "南非",
        "label": "南非"
    },
    {
        "key": "西班牙",
        "label": "西班牙"
    },
    {
        "key": "斯里兰卡",
        "label": "斯里兰卡"
    },
    {
        "key": "苏丹",
        "label": "苏丹"
    },
    {
        "key": "苏里南",
        "label": "苏里南"
    },
    {
        "key": "斯威士兰",
        "label": "斯威士兰"
    },
    {
        "key": "瑞典",
        "label": "瑞典"
    },
    {
        "key": "瑞士",
        "label": "瑞士"
    },
    {
        "key": "叙利亚",
        "label": "叙利亚"
    },
    {
        "key": "台湾省",
        "label": "台湾省"
    },
    {
        "key": "塔吉克斯坦",
        "label": "塔吉克斯坦"
    },
    {
        "key": "坦桑尼亚",
        "label": "坦桑尼亚"
    },
    {
        "key": "泰国",
        "label": "泰国"
    },
    {
        "key": "多哥",
        "label": "多哥"
    },
    {
        "key": "汤加",
        "label": "汤加"
    },
    {
        "key": "特立尼达和多巴哥",
        "label": "特立尼达和多巴哥"
    },
    {
        "key": "突尼斯",
        "label": "突尼斯"
    },
    {
        "key": "土耳其",
        "label": "土耳其"
    },
    {
        "key": "土库曼斯坦",
        "label": "土库曼斯坦"
    },
    {
        "key": "乌干达",
        "label": "乌干达"
    },
    {
        "key": "乌克兰",
        "label": "乌克兰"
    },
    {
        "key": "阿拉伯联合酋长国",
        "label": "阿拉伯联合酋长国"
    },
    {
        "key": "英国",
        "label": "英国"
    },
    {
        "key": "美国",
        "label": "美国"
    },
    {
        "key": "乌拉圭",
        "label": "乌拉圭"
    },
    {
        "key": "乌兹别克斯坦",
        "label": "乌兹别克斯坦"
    },
    {
        "key": "委内瑞拉",
        "label": "委内瑞拉"
    },
    {
        "key": "越南",
        "label": "越南"
    },
    {
        "key": "也门",
        "label": "也门"
    },
    {
        "key": "南斯拉夫",
        "label": "南斯拉夫"
    },
    {
        "key": "津巴布韦",
        "label": "津巴布韦"
    },
    {
        "key": "扎伊尔",
        "label": "扎伊尔"
    },
    {
        "key": "赞比亚",
        "label": "赞比亚"
    } 
]}

    